--1. Напишете заявка, която извежда броя на класовете бойни кораби.
SELECT COUNT(TYPE)
FROM CLASSES
WHERE TYPE='bb'
--2. Напишете заявка, която извежда средния брой оръдия за всеки клас боен кораб.

--3. Напишете заявка, която извежда средния брой оръдия за всички бойни кораби.
--4. Напишете заявка, която извежда за всеки клас първата и последната година, в
--която кораб от съответния клас е пуснат на вода.
--5. Напишете заявка, която извежда броя на корабите, потънали в битка според
--класа.
--6. Напишете заявка, която извежда броя на корабите, потънали в битка според
--класа, за тези класове с повече от 2 кораба.
--7. Напишете заявка, която извежда средния калибър на оръдията на корабите за
--всяка страна.